# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [49]:
# your code here
import sqlalchemy
import pandas as pd
    
engine = sqlalchemy.create_engine("mysql+pymysql://ironhacker_read:ir0nhack3r@35.239.232.23/sakila")

query = '''
SELECT first_name, last_name, film_id 

FROM actor

JOIN film_actor ON actor.actor_id = film_actor.actor_id
'''
sakila = pd.read_sql(query, engine)

KeyError: 'film_actor'

# Challenge 2 - Working with JSON files

Import the pandas library.

In [1]:
# your code here

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [10]:
# your code here
df = pd.read_json('/home/emanuele/Desktop/IronHack/Week2/lab-import-export/data/nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [11]:
# your code here
df.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [12]:
# your code here
df['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [26]:
# your code here
df.to_json('/home/emanuele/Desktop/IronHack/Week2/lab-import-export/data/nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [27]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [28]:
# your code here
shuttle = pd.read_csv(tst_url, names=cols, sep=' ')

Let's verify that this worked by looking at the `head()` function.

In [29]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [30]:
# your code here
shuttle.to_csv('/home/emanuele/Desktop/IronHack/Week2/lab-import-export/data/shuttle.csv', header=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [31]:
# your code here
astronaut = pd.read_excel('/home/emanuele/Desktop/IronHack/Week2/lab-import-export/data/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [32]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [33]:
# your code here
astronaut['Undergraduate Major'].value_counts()

Physics                                          35
Aerospace Engineering                            33
Mechanical Engineering                           30
Aeronautical Engineering                         28
Electrical Engineering                           23
Engineering Science                              13
Engineering                                      12
Mathematics                                      11
Chemistry                                        10
Chemical Engineering                              9
Naval Sciences                                    9
Astronautical Engineering                         8
Aeronautical & Astronautical Engineering          6
Biology                                           5
Mathematics & Physics                             5
Geology                                           5
Civil Engineering                                 5
Physics & Astronomy                               4
Applied Science & Engineering                     4
Aeronautics & Astronautics                        3
Engineering Physics                               3
Applied Mathematics                               3
Computer Science                                  3
Engineering Management                            2
Physics & Mathematics                             2
Zoology                                           2
Biological Science                                2
Engineering Mechanics                             2
Chemistry & Biology                               2
Education                                         2
                                                 ..
Ceramic Engineering                               1
Mathematical & Electrical Science                 1
Economics                                         1
Philosophy                                        1
Business Finance                                  1
Biochemistry                                      1
Mathematics & Statistics; Chemistry               1
Bioscience                                        1
Business Management; Aeronautical Engineering     1
Electronics Engineering                           1
Marine Engineering & Nautical Science             1
Molecular Biology                                 1
Human Biology                                     1
Mechanical & Aeronautical Engineering             1
Physiology                                        1
Mathematics & Economics                           1
Electrical Science                                1
Electrical Engineering; Computer Science          1
Computer & Systems Engineering                    1
Metallurgical Engineering                         1
Physics & Mechanical Engineering                  1
Military Engineering                              1
Animal Science                                    1
Business Economics                                1
Geosciences                                       1
Applied Biology; Mechanical Engineering           1
Systems Engineering                               1
Earth Sciences                                    1
Ecological Science                                1
Industrial Management                             1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [34]:
# your code here
astronaut.to_csv('/home/emanuele/Desktop/IronHack/Week2/lab-import-export/data/astronaut.csv', header=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [35]:
# your code here
fertility = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt', header=None)

In [36]:
fertility.head()

      0     1  2  3  4  5    6  7     8  9
0 -0.33  0.69  0  1  1  0  0.8  0  0.88  N
1 -0.33  0.94  1  0  1  0  0.8  1  0.31  O
2 -0.33  0.50  1  0  0  0  1.0 -1  0.50  N
3 -0.33  0.75  0  1  1  0  1.0 -1  0.38  N
4 -0.33  0.67  1  1  0  0  0.8 -1  0.50  O

In [37]:
cols = ['Season', 'Age', 'Childish disease', 'Accident or serious trauma', 'Surgical intervention', 'High fevers', 'Freq. alcohol',
        'Smoking', 'Hrs. sitting per day', 'Diagnosis']

In [38]:
fertility.columns = cols

In [53]:
fertility.head()

,Season,Age,Childish disease,Accident or serious trauma,Surgical intervention,High fevers,Freq. alcohol,Smoking,Hrs. sitting per day,Diagnosis
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O